Конфигурация отчетов/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
				<xr:Item>AccumulationRegister.ОборотПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолжностиПоПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипРассчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДневнойОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСоздан</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОрдер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Enums/ТипРассчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипРассчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезнальныйРассчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Catalogs/СистемныеПоставщики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СистемныеПоставщики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Documents/ПриходнаяНакладная/Ext/ManagerModule.bsl
Функция СоздатьНакладную(Заведение, ДатаНакладной, Склад, Поставщик, ТипНакладной, Сумма, Ссылка, ВнешнийНомер, ВладелецДокумента) Экспорт
	
	ПрихДок = Документы.ПриходнаяНакладная.СоздатьДокумент();
	ПрихДок.Дата =  ДатаНакладной;
	ПрихДок.Заведение = Заведение;
	ПрихДок.Склад = Склад;
	ПрихДок.Поставщик = Поставщик;
	ПрихДок.ДокументСоздан = ВладелецДокумента;

	Если ТипНакладной = Истина Тогда
		ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.БезнальныйРассчет;
	Иначе
		ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.Наличные;
	КонецЕсли;
	ПрихДок.Сумма = Сумма;
	ПрихДок.СсылкаНаОтчет = Ссылка;
	ПрихДок.ВнешнийНомер = ВнешнийНомер;

	ПрихДок.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ПрихДок.Ссылка;
	
КонецФункции

Процедура РедактированиеПрихДок(Ссылка, Заведение, Склад, Поставщик, ТипНакладной, ВнешнийНомер, Сумма) Экспорт 
	
	ПрихДок = Ссылка.ПолучитьОбъект();
	ПрихДок.Заведение = Заведение; 
	ПрихДок.Склад = Справочники.Склады.ПолучитьСклад(Заведение, Склад); 
	ПрихДок.Поставщик = Поставщик;
	ПрихДок.ТипНакладной = ТипНакладной;
	ПрихДок.ВнешнийНомер = ВнешнийНомер;
	ПрихДок.Сумма = Сумма;

	ПрихДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура РедактированиеПрихДок_В2(Ссылка, ПараметрыРедактирования) Экспорт  //в параметрах структура: поле редактирования, новое значение
	
	
	ПрихДок = Ссылка.ПолучитьОбъект();
	ПолеРедактирования = ПараметрыРедактирования.Реквизит;
	Значение = ПараметрыРедактирования.Значение;
	
	Если ПолеРедактирования = "Заведение" Тогда
		ПрихДок.Заведение = Значение; 	
	ИначеЕсли ПолеРедактирования = "Поставщик" Тогда
		ПрихДок.Поставщик = Значение;
		ПрихДок.Склад = Справочники.Склады.ПолучитьСклад(ПрихДок.Заведение, ПрихДок.Поставщик.Склад);	
	ИначеЕсли ПолеРедактирования = "БН" Тогда
		Если Значение = Истина Тогда
			ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.БезнальныйРассчет;
		Иначе
			 ПрихДок.ТипНакладной = Перечисления.ТипРассчетов.Наличные;
		КонецЕсли;
	ИначеЕсли ПолеРедактирования = "Номер" Тогда
		ПрихДок.ВнешнийНомер = Значение;
	ИначеЕсли ПолеРедактирования = "Сумма" Тогда
		ПрихДок.Сумма = Значение;
		ИначеЕсли ПолеРедактирования = "Закупщик" Тогда
		ПрихДок.Закупщик = Значение;
	КонецЕсли; 
	//НакладныеНомер
//НакладныеСуммаПН
//НакладныеОплачено
//НакладныеЗакупщик
//НакладныеБН
//НакладныеПоставщик
			
	ПрихДок.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция СсылкаНаНакладную(Заведение, ДатаСмены,ИндексСтраницы, ИндексСтроки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Заведение КАК Заведение,
		|	ПриходнаяНакладная.ИндексСтроки КАК ИндексСтроки,
		|	ПриходнаяНакладная.ИндексСтраницы КАК ИндексСтраницы,
		|	ПриходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.Дата = &Дата
		|	И ПриходнаяНакладная.Заведение = &Заведение
		|	И ПриходнаяНакладная.ИндексСтроки = &ИндексСтроки
		|	И ПриходнаяНакладная.ИндексСтраницы = &ИндексСтраницы";
	
	Запрос.УстановитьПараметр("Дата", ДатаСмены);
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("ИндексСтраницы", ИндексСтраницы);
	Запрос.УстановитьПараметр("ИндексСтроки", ИндексСтроки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();		
		
	Возврат Выборка.Ссылка;	
	
КонецФункции

Функция ВладелецДокументаПрихДок(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК Ссылка,
		|	ПриходнаяНакладная.ДокументСоздан КАК ДокументСоздан
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ДокументСоздан;
	
КонецФункции

Функция СсылкаНаДокЗакупщика(Заведение, ДатаОтчета) Экспорт
	
	Поставщик = Справочники.СистемныеПоставщики.ПолучитьСистемногоПоставщика(Заведение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Поставщик КАК Поставщик,
		|	ПриходнаяНакладная.Дата КАК Дата,
		|	ПриходнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	ПриходнаяНакладная.Поставщик = &Поставщик
		|	И ПриходнаяНакладная.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", ДатаОтчета);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
    Возврат Выборка.Ссылка
	

КонецФункции // СсылкаНаДокЗакупщика()
